chore: fix CI
